Dynamo.Logging.IAnalyticsClient
Implements analytics and logging functions.

Dynamo.Logging.IAnalyticsClient.Session
Gets session object for this client

Dynamo.Logging.IAnalyticsClient.Start(Dynamo.Models.DynamoModel)
Starts the client when DynamoModel is created. This method initializes
the Analytics service and application life cycle start is tracked.
model: