Dynamo.Engine.LibraryServices.IsFunctionBuiltIn(System.String,System.String)
Checks if a given function is in the builtinFunctionGroups so we do not necessarily look for it's library based on its Assembly tag
library: assembly name
nickname: nick name, used for searching as key with default value ""
Returns: