Dynamo.Graph.Nodes.PortModel.PortName
Name of the port.

Dynamo.Graph.Nodes.PortModel.ToolTipContent
Tooltip of the port.

Dynamo.Graph.Nodes.PortModel.Level
List at level.

Dynamo.Graph.Nodes.PortModel.UseLevels
If use level is enabled.

Dynamo.Graph.Nodes.PortModel.ShouldKeepListStructure
If needs to keep list structure.

Dynamo.Graph.Nodes.PortModel.OnPortDisconnected
Called when a port is disconnected.