Dynamo.Interfaces.IBackgroundPreviewPreference
interface that defines settings backgroundPreview preferences,
this interface should be merged with IPreferences at Dynamo 2.0

Dynamo.Interfaces.IBackgroundPreviewPreference.BackgroundPreviews
Collection of pairs [BackgroundPreviewName;isActive]

Dynamo.Interfaces.IBackgroundPreviewPreference.GetIsBackgroundPreviewActive(System.String)
Returns active state of specified background preview
name: Background preview name
Returns: The active state

Dynamo.Interfaces.IBackgroundPreviewPreference.SetIsBackgroundPreviewActive(System.String,System.Boolean)
Sets active state of specified background preview
name: Background preview name
value: Active state to set