Dynamo.Graph.Nodes.ZeroTouch.DSFunction.IsInputNode
Indicates whether Node is input or not.

Dynamo.Graph.Nodes.ZeroTouch.DSFunction.#ctor(Dynamo.Engine.FunctionDescriptor)
Initializes a new instance of the Dynamo.Graph.Nodes.ZeroTouch.DSFunction class.
descriptor: Function descritor.