Dynamo.Models.DynamoModel.CreateProxyNodeCommand.#ctor(System.String,System.String,System.Double,System.Double,System.Boolean,System.Boolean,System.String,System.Int32,System.Int32)
nodeId:
nodeName:
x:
y:
defaultPosition:
transformCoordinates:
nickName:
inputs:
outputs: