Dynamo.Library.TypedParameter.#ctor(System.String,ProtoCore.Type,ProtoCore.AST.AssociativeAST.AssociativeNode,System.String,System.String)
This function creates TypedParameter
parameter: parameter name
type: parameter type
defaultValue: parameter default value
shortArgumentName: short name is used as tooltip
summary: parameter description

Dynamo.Library.TypedParameter.DefaultValue
Returns default value of the parameter.