Dynamo.Configuration.PreferenceSettings.Save(System.String)
Saves PreferenceSettings in XML File Path if possible,
else return false
filePath: Path of the XML File
Returns: Whether file is saved or error occurred.

Dynamo.Configuration.PreferenceSettings.SaveInternal(System.String)
Saves PreferenceSettings in a default directory when no path is
specified.
preferenceFilePath: The file path to save preference
settings to. If this parameter is null or empty string, preference
settings will be saved to the default path.
Returns: Whether file is saved or error occurred.

Dynamo.Configuration.PreferenceSettings.Load(System.String)
Returns PreferenceSettings from XML path if possible,
else return PreferenceSettings with default values
filePath: Path of the XML File
Returns:
Stored PreferenceSettings from xml file or
Default PreferenceSettings if xml file is not found.