Dynamo.Core.CustomNodeManager.#ctor(Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,Dynamo.Migration.MigrationManager)
This function creates CustomNodeManager
nodeFactory: NodeFactory
migrationManager: MigrationManager

Dynamo.Core.CustomNodeManager.TryGetFunctionWorkspace(System.Guid,System.Boolean,Dynamo.Graph.Workspaces.ICustomNodeWorkspaceModel@)
Returns the function workspace.
id: The identifier.
isTestMode: if set to true [is test mode].
ws: The workspace.
Returns:

Dynamo.Core.CustomNodeManager.TryGetFunctionDefinition(System.Guid,System.Boolean,Dynamo.CustomNodeDefinition@)
Returns the function definition from a guid.
id: Custom node identifier.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
definition:
Returns:

Dynamo.Core.CustomNodeManager.TryGetInfoFromPath(System.String,System.Boolean,Dynamo.CustomNodeInfo@)
Returns a guid from a specific path, internally this first calls GetDefinitionFromPath
path: The path from which to get the guid
isTestMode:
Flag specifying whether or not this should operate in "test mode".
info:
Returns: The custom node info object - null if we failed