Dynamo.Logging.Analytics.Start(Dynamo.Models.DynamoModel)
Starts the client when DynamoModel is created. This method initializes
the Analytics service and application life cycle start is tracked.
model: DynamoModel

Dynamo.Logging.Analytics.ReportingAnalytics
Returns if analytics reporting is ON