Dynamo.Graph.Nodes.Statement.GetDefinedVariableNames(Dynamo.Graph.Nodes.Statement,System.Boolean)
Returns the names of the variables that have been declared in the statement
s:  Statement whose variable names to be queried.
onlyTopLevel:  Bool to check if required to return reference variables in sub statements as well
Returns: