Dynamo.Models.DynamoModel.IStartConfiguration2
A new interface that adds a headless flag on top of the existing
IStartConfiguration, as the existing interface can't be changed
until 2.0.0.  The flag is used to suppress update checks and
analytics.
TODO: Merge this into IStartConfiguration for 2.0.0.

Dynamo.Models.DynamoModel.IStartConfiguration2.IsHeadless
If true, the program does not have a UI.
No update checks or analytics collection should be done.