Dynamo.Models.DynamoModel.OnDeletionStarted
Called when Deletion started.

Dynamo.Models.DynamoModel.WorkspaceSaved
Occurs when a workspace is saved to a file

Dynamo.Models.DynamoModel.ResetEngine(System.Boolean)
Call this method to reset the virtual machine, avoiding a race
condition by using a thread join inside the vm executive.
markNodesAsDirty: Set this parameter to true to force
reset of the execution substrait. Note that setting this parameter
to true will have a negative performance impact.

Dynamo.Models.DynamoModel.OpenFileFromPath(System.String,System.Boolean)
Opens a Dynamo workspace from a path to an Xml file on disk.
xmlPath: Path to file
forceManualExecutionMode: Set this to true to discard
execution mode specified in the file and set manual mode