Dynamo.Graph.Presets.PresetModel.NameAttributeName
Name attribute name used during serialization

Dynamo.Graph.Presets.PresetModel.NicknameAttributeName
Nickname attribute name used during serialization