Dynamo.Graph.Workspaces.WorkspaceModel.ZOOM_MAXIMUM
Represents maximum value of workspace zoom

Dynamo.Graph.Workspaces.WorkspaceModel.ZOOM_MINIMUM
Represents minimum value of workspace zoom

Dynamo.Graph.Workspaces.WorkspaceModel.OnZoomChanged(System.Object,Dynamo.Models.ZoomEventArgs)
Used during open and workspace changes to set the zoom of the workspace
sender: The object which triggers the event
e: The zoom event data.

Dynamo.Graph.Workspaces.WorkspaceModel.SaveAs(System.String,ProtoCore.RuntimeCore,System.Boolean)
Save to a specific file path, if the path is null or empty, does nothing.
If successful, the CurrentWorkspace.FilePath field is updated as a side effect
newPath: The path to save to
runtimeCore: The ProtoCore.RuntimeCore object
to obtain serialized trace data for node list to save.
isBackup: Indicates whether saved workspace is backup or not. If it's not backup,
we should add it to recent files. Otherwise leave it.

Dynamo.Graph.Workspaces.WorkspaceModel.RemoveNode(Dynamo.Graph.Nodes.NodeModel)
Removes a node from this workspace.
This method does not raise a NodesModified event. (LC notes this is clearly not true)
model: The node which is being removed from the worksapce.

Dynamo.Graph.Workspaces.WorkspaceModel.Save(ProtoCore.RuntimeCore)
Save assuming that the Filepath attribute is set.
runtimeCore: The ProtoCore.RuntimeCore object
to obtain serialized trace data for node list to save.

Dynamo.Graph.Workspaces.WorkspaceModel.AddPresetCore(System.String,System.String,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
this method creates a new preset state from a set of NodeModels and adds this new state to this presets collection
name: the name of preset state
description: a description of what the state does
currentSelection: a set of NodeModels that are to be serialized in this state

Dynamo.Graph.Workspaces.WorkspaceModel.RemovePreset(Dynamo.Graph.Presets.PresetModel)
Removes a specified Dynamo.Graph.Presets.PresetModel object from the preset collection of the workspace.
state: Dynamo.Graph.Presets.PresetModel object to remove.

Dynamo.Graph.Workspaces.WorkspaceModel.ImportPresets(System.Collections.Generic.IEnumerable{Dynamo.Graph.Presets.PresetModel})
Adds a specified collection Dynamo.Graph.Presets.PresetModel objects to the preset collection of the workspace.
presetCollection: Dynamo.Graph.Presets.PresetModel objects to add.