Dynamo.Graph.Workspaces.WorkspaceModel.ZoomEventHandler
Function that can be used to respond to a changed workspace Zoom amount.
sender: The object where the event handler is attached.
e: The event data.