Dynamo.Migration.MigrationManager.CreateFunctionNode(System.Xml.XmlDocument,System.Xml.XmlElement,System.Int32,System.String,System.String,System.String)
Call this method to create an empty DSFunction node that contains
basic function node information.
document: The XmlDocument to create the node in.
oldNode: Base node to create a new one
nodeIndex: Index of the node
assembly: Name of the assembly that implements this
function.
nickname: The nickname to display on the node.
signature: The signature of the function.
Returns: Returns the XmlElement that represents a DSFunction node
with its basic function information with default attributes.

Dynamo.Migration.MigrationManager.CreateVarArgFunctionNode(System.Xml.XmlDocument,System.Xml.XmlElement,System.Int32,System.String,System.String,System.String,System.String)
Call this method to create an empty DSVarArgFunction node that contains
basic function node information.
document: The XmlDocument to create the node in.
oldNode: Base node to create a new one
nodeIndex: Index of the node
assembly: Name of the assembly that implements this
function.
nickname: The nickname to display on the node.
signature: The signature of the function.
Returns: Returns the XmlElement that represents a DSVarArgFunction node
with its basic function information with default attributes.

Dynamo.Migration.MigrationManager.CreateNode(System.Xml.XmlDocument,System.Xml.XmlElement,System.Int32,System.String,System.String)
This method creates an empty NodeModel node that contains
basic code block node information.
document: The XmlDocument to create the node in.
oldNode: Base node to create a new one
nodeIndex: Index of the node
name: Node name
nickname: Name to display on the node
Returns: Returns the XmlElement that represents a NodeModel node
with its basic function information with default attributes.

Dynamo.Migration.MigrationManager.CloneAndChangeName(System.Xml.XmlElement,System.String,System.String,System.Boolean)
Call this method to create a clone of the original XmlElement and
change its type at one go. This method preserves all the attributes
while updating only the type name.
element: The XmlElement to be cloned and the type name
updated.
type: The fully qualified name of the new type.
nickname: The new nickname, by which this node is known.
cloneInnerXml: Parameter indicating whether the inner xml
of the original node should be cloned.
Returns: Returns the cloned and updated XmlElement.

Dynamo.Migration.MigrationManager.SetFunctionSignature(System.Xml.XmlElement,System.String,System.String,System.String)
Sets function data such as assembly, nickname and function name
element: Xml element where to set data
assemblyName: Assembly name of the function
methodName: Nickname of the function
signature: Name of the function