Dynamo.Updates.IHostUpdateManager
HostUpdateManager to keep track of the latest host version (i.e. DynamoRevit/DynamoStudio)
This additional Interface is created to ensure backward compatibility when Host versions are older than Core versions
This Interface contains two getter/setter methods to update the Host Version and Name
This Interface should be removed and merged with UpdateManager in 2.0

Dynamo.Updates.IHostUpdateManager.HostVersion
Get the current version of the Host

Dynamo.Updates.IHostUpdateManager.HostName
Get the current name of the Host