Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.#ctor(`0)
Initializes a new instance of
the ZeroTouchNodeController class with FunctionDescriptor.
zeroTouchDef: FunctionDescriptor describing the function
that this controller will call.