Dynamo.Interfaces.IPreviewBubblePreference
interface that defines settings previewBubble preferences,
this interface should be merged with IPreferences at Dynamo 2.0

Dynamo.Interfaces.IPreviewBubblePreference.ShowPreviewBubbles
Indicates if preview bubbles should be displayed on nodes.