Dynamo.Graph.Nodes.CustomNodes.Function.#ctor(Dynamo.CustomNodeDefinition,System.String,System.String,System.String)
Initializes a new instance of the Dynamo.Graph.Nodes.CustomNodes.Function class.
def: CustomNode definition.
nickName: Nickname.
description: Description.
category: Category.