Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.SaveAs(System.String,ProtoCore.RuntimeCore,System.Boolean)
Saves custom node workspace to a file
newPath: New location to save the workspace.
runtimeCore: The ProtoCore.RuntimeCore object
to obtain serialized trace data for node list to save.
isBackup: Indicates whether saved workspace is backup or not. If it's not backup,
we should add it to recent files. Otherwise leave it.
Returns: