Dynamo.Graph.Nodes.PortData.NickName
Nickname of the port.

Dynamo.Graph.Nodes.PortData.#ctor(System.String,System.String)
Creates PortData.
nickName: Nickname of the port
tip: Tooltip of the port

Dynamo.Graph.Nodes.PortData.#ctor(System.String,System.String,ProtoCore.AST.AssociativeAST.AssociativeNode)
Creates PortData.
nickName: Nickname of the port
toolTipString: Tooltip of the port
defaultValue: Default value of the port