Dynamo.Graph.Nodes.CodeBlockNodeModel.IsInputNode
Indicates whether node is input node

Dynamo.Graph.Nodes.CodeBlockNodeModel.#ctor(System.String,System.Double,System.Double,Dynamo.Engine.LibraryServices,ProtoCore.Namespace.ElementResolver)
Initilizes a new instance of the Dynamo.Graph.Nodes.CodeBlockNodeModel class
userCode: Code block content
xPos: X coordinate of the code block
yPos: Y coordinate of the code block
libraryServices: Dynamo.Engine.LibraryServices object to manage
builtin libraries as well as imported libraries
resolver: Responsible for resolving
a partial class name to its fully resolved name

Dynamo.Graph.Nodes.CodeBlockNodeModel.#ctor(System.String,System.Guid,System.Double,System.Double,Dynamo.Engine.LibraryServices,ProtoCore.Namespace.ElementResolver)
Initilizes a new instance of the Dynamo.Graph.Nodes.CodeBlockNodeModel class
userCode: Code block content
guid: Identifier of the code block
xPos: X coordinate of the code block
yPos: Y coordinate of the code block
libraryServices: Dynamo.Engine.LibraryServices object to manage
builtin libraries as well as imported libraries
resolver: Responsible for resolving
a partial class name to its fully resolved name