Dynamo.Logging.DynamoAnalyticsClient.Start(Dynamo.Models.DynamoModel)
Starts the client when DynamoModel is created. This method initializes
the Analytics service and application life cycle start is tracked.
model: