Dynamo.Engine.LibraryServices.ImportLibrary(System.String,System.Boolean)
Import a library (if it hasn't been imported yet).
library: The library to be loaded
isExplicitlyImportedLib: Indicates if the library has been imported using the "File | ImportLibrary" command