Dynamo.Extensions.ExtensionLoader
Provides functionality for loading Dynamo's extensions.
This class loads formatted XMLs which contain information about
*Extension.dll and type name of IExtension inheritor.
Example:
..\ExtansionName.dll
Dynamo.ExtansionName.ExtansionTypeName