Dynamo.Properties.Resources.PythonTemplateDefaultFile
Looks up a localized string similar to Python template set to default file.

Dynamo.Properties.Resources.PythonTemplateInvalid
Looks up a localized string similar to Python template : no valid template found..

Dynamo.Properties.Resources.PythonTemplateUserFile
Looks up a localized string similar to Python template set to user file.