Dynamo.Library.TypedParameter.#ctor(System.String,System.String,System.Int32,System.String)
This function creates TypedParameter
name: parameter name
TypeName: parameter TypeName, serialized name of ProtoCore.Type
TypeRank: parameter TypeRank, serialized rank of ProtoCore.Type
defaultValue: parameter defaultValue

Dynamo.Library.TypedParameter.Summary
Returns summary of the parameter.

Dynamo.Library.TypedParameter.ToNameString
Returns a string in a specific format (Name:Type.Name)
ex: dateTime1:System.DateTime,  test:Autodesk.DesignScript.Geomtery.Curve
Refer to https://jira.autodesk.com/browse/QNTM-3786
Returns: