Dynamo.Engine.Profiling.IProfilingExecutionTimeData.TotalExecutionTime
Returns the total amount of time spent compiling and executing nodes.

Dynamo.Engine.Profiling.IProfilingExecutionTimeData.NodeExecutionTime(Dynamo.Graph.Nodes.NodeModel)
Returns the amount of time spent compiling and executing a specific node.