Autodesk.DesignScript.Interfaces.ITransformable.SetTransform(System.Double[])
Set the transform as a double array, this transform is applied to all geometry in the renderPackage.
This matrix should be laid out as follows in row vector order:
[Xx,Xy,Xz, 0,
Yx, Yy, Yz, 0,
Zx, Zy, Zz, 0,
offsetX, offsetY, offsetZ, W]
NOTE: This method should transform the matrix from row vector order to whatever form is needed by the implementation.
matrix: